xtoolbox/TeenyUSB/sample/boards/stm32h743_openmv/system_stm32h7xx_HSI.c
  /*-------------------------------- PLL Configuration -----------------------*/
  /* Check the parameters */
  //assert_param(IS_RCC_PLL(RCC_OscInitStruct__PLL_PLLState));
  if ((RCC_OscInitStruct__PLL_PLLState) != RCC_PLL_NONE)
  {
    /* Check if the PLL is used as system clock or not */
    if(__HAL_RCC_GET_SYSCLK_SOURCE() != RCC_CFGR_SWS_PLL1)
    {
      if((RCC_OscInitStruct__PLL_PLLState) == RCC_PLL_ON)
      {
        /* Check the parameters */
        assert_param(IS_RCC_PLLSOURCE(RCC_OscInitStruct__PLL_PLLSource));
        assert_param(IS_RCC_PLLM_VALUE(RCC_OscInitStruct__PLL_PLLM));
        assert_param(IS_RCC_PLLN_VALUE(RCC_OscInitStruct__PLL_PLLN));
        assert_param(IS_RCC_PLLP_VALUE(RCC_OscInitStruct__PLL_PLLP));
        assert_param(IS_RCC_PLLQ_VALUE(RCC_OscInitStruct__PLL_PLLQ));
        assert_param(IS_RCC_PLLQ_VALUE(RCC_OscInitStruct__PLL_PLLR));

        /* Disable the main PLL_ */
        __HAL_RCC_PLL_DISABLE();

        /* Get Start Tick*/
        tickstart = HAL_GetTick();

        /* Wait till PLL is ready */
        while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLRDY) != RESET)
        {
          if((int32_t) (HAL_GetTick() - tickstart ) > PLL_TIMEOUT_VALUE)
          {
            while(1);
          }
        }

        /* Configure the main PLL clock source, multiplication and division factors. */
        __HAL_RCC_PLL_CONFIG(RCC_OscInitStruct__PLL_PLLSource,
                             RCC_OscInitStruct__PLL_PLLM,
                             RCC_OscInitStruct__PLL_PLLN,
                             RCC_OscInitStruct__PLL_PLLP,
                             RCC_OscInitStruct__PLL_PLLQ,
                             RCC_OscInitStruct__PLL_PLLR);

         /* Configure PLL  PLL1FRACN */
         __HAL_RCC_PLLFRACN_CONFIG(RCC_OscInitStruct__PLL_PLLFRACN);

        /* Select PLL1 input reference frequency range: VCI */ 
        __HAL_RCC_PLL_VCIRANGE(RCC_OscInitStruct__PLL_PLLRGE) ;

        /* Select PLL1 output frequency range : VCO */
        __HAL_RCC_PLL_VCORANGE(RCC_OscInitStruct__PLL_PLLVCOSEL) ;

        /* Enable PLL System Clock output. */
         __HAL_RCC_PLLCLKOUT_ENABLE(RCC_PLL1_DIVP);

        /* Enable PLL1Q Clock output. */
         __HAL_RCC_PLLCLKOUT_ENABLE(RCC_PLL1_DIVQ);
 
        /* Enable PLL1R  Clock output. */
         __HAL_RCC_PLLCLKOUT_ENABLE(RCC_PLL1_DIVR);

        /* Enable PLL1FRACN . */
         __HAL_RCC_PLLFRACN_ENABLE();

        /* Enable the main PLL_ */
        __HAL_RCC_PLL_ENABLE();

        /* Get Start Tick*/
        tickstart = HAL_GetTick();

        /* Wait till PLL is ready */
        while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLRDY) == RESET)
        {
          if((int32_t) (HAL_GetTick() - tickstart ) > PLL_TIMEOUT_VALUE)
          {
            while(1);
          }
        }
      }
      else
      {
        /* Disable the main PLL. */
        __HAL_RCC_PLL_DISABLE();

        /* Get Start Tick*/
        tickstart = HAL_GetTick();

        /* Wait till PLL is ready */
        while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLRDY) != RESET)
        {
          if((int32_t) (HAL_GetTick() - tickstart ) > PLL_TIMEOUT_VALUE)
          {
            while(1);
          }
        }
      }
    }
    else
    {
      while(1);
    }
  }
    /**Initializes the CPU, AHB and APB busses clocks 
    */
#define  RCC_ClkInitStruct__ClockType   (RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK\
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2\
                              |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1)
#define  RCC_ClkInitStruct__SYSCLKSource  RCC_SYSCLKSOURCE_PLLCLK
#define  RCC_ClkInitStruct__SYSCLKDivider  RCC_SYSCLK_DIV1
#define  RCC_ClkInitStruct__AHBCLKDivider  RCC_HCLK_DIV2
#define  RCC_ClkInitStruct__APB3CLKDivider  RCC_APB3_DIV2
#define  RCC_ClkInitStruct__APB1CLKDivider  RCC_APB1_DIV2
#define  RCC_ClkInitStruct__APB2CLKDivider  RCC_APB2_DIV2
#define  RCC_ClkInitStruct__APB4CLKDivider  RCC_APB4_DIV2
#define  FLatency                           FLASH_LATENCY_2
  //if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  //{
  //  _Error_Handler(__FILE__, __LINE__);
  //}
  if(FLatency > (FLASH->ACR & FLASH_ACR_LATENCY))
  {
    /* Program the new number of wait states to the LATENCY bits in the FLASH_ACR register */
    __HAL_FLASH_SET_LATENCY(FLatency);

    /* Check that the new number of wait states is taken into account to access the Flash
    memory by reading the FLASH_ACR register */
    if((FLASH->ACR & FLASH_ACR_LATENCY) != FLatency)
    {
      while(1);
    }

  }
   /*-------------------------- HCLK Configuration --------------------------*/
    if(((RCC_ClkInitStruct__ClockType) & RCC_CLOCKTYPE_HCLK) == RCC_CLOCKTYPE_HCLK)
    {
      //assert_param(IS_RCC_HCLK(RCC_ClkInitStruct__AHBCLKDivider));
      MODIFY_REG(RCC->D1CFGR, RCC_D1CFGR_HPRE, RCC_ClkInitStruct__AHBCLKDivider);
    }

    /*------------------------- SYSCLK Configuration -------------------------*/
    if(((RCC_ClkInitStruct__ClockType) & RCC_CLOCKTYPE_SYSCLK) == RCC_CLOCKTYPE_SYSCLK)
    {
      //assert_param(IS_RCC_SYSCLK(RCC_ClkInitStruct__SYSCLKDivider));
      //assert_param(IS_RCC_SYSCLKSOURCE(RCC_ClkInitStruct__SYSCLKSource));
      MODIFY_REG(RCC->D1CFGR, RCC_D1CFGR_D1CPRE, RCC_ClkInitStruct__SYSCLKDivider);
      /* HSE is selected as System Clock Source */
      if(RCC_ClkInitStruct__SYSCLKSource == RCC_SYSCLKSOURCE_HSE)
      {
        /* Check the HSE ready flag */
        if(__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) == RESET)
        {
          while(1);
        }
      }
      /* PLL is selected as System Clock Source */
      else if(RCC_ClkInitStruct__SYSCLKSource == RCC_SYSCLKSOURCE_PLLCLK)
      {
        /* Check the PLL ready flag */
        if(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLRDY) == RESET)
        {
          while(1);
        }
      }
      /* CSI is selected as System Clock Source */
      else if(RCC_ClkInitStruct__SYSCLKSource == RCC_SYSCLKSOURCE_CSI)
      {
        /* Check the PLL ready flag */
        if(__HAL_RCC_GET_FLAG(RCC_FLAG_CSIRDY) == RESET)
        {
          while(1);
        }
      }
      /* HSI is selected as System Clock Source */
      else
      {
        /* Check the HSI ready flag */
        if(__HAL_RCC_GET_FLAG(RCC_FLAG_HSIRDY) == RESET)
        {
          while(1);
        }
      }
      MODIFY_REG(RCC->CFGR, RCC_CFGR_SW, RCC_ClkInitStruct__SYSCLKSource);

      /* Get Start Tick*/
      tickstart = HAL_GetTick();

      if(RCC_ClkInitStruct__SYSCLKSource == RCC_SYSCLKSOURCE_HSE)
      {
        while (__HAL_RCC_GET_SYSCLK_SOURCE() != RCC_CFGR_SWS_HSE)
        {
          if((int32_t) (HAL_GetTick() - tickstart ) > CLOCKSWITCH_TIMEOUT_VALUE)
          {
            while(1);
          }
        }
      }
      else if(RCC_ClkInitStruct__SYSCLKSource == RCC_SYSCLKSOURCE_PLLCLK)
      {
        while (__HAL_RCC_GET_SYSCLK_SOURCE() != RCC_CFGR_SWS_PLL1)
        {
          if((int32_t) (HAL_GetTick() - tickstart ) > CLOCKSWITCH_TIMEOUT_VALUE)
          {
            while(1);
          }
        }
      }
      else if(RCC_ClkInitStruct__SYSCLKSource == RCC_SYSCLKSOURCE_CSI)
      {
        while (__HAL_RCC_GET_SYSCLK_SOURCE() != RCC_CFGR_SWS_CSI)
        {
          if((int32_t) (HAL_GetTick() - tickstart ) > CLOCKSWITCH_TIMEOUT_VALUE)
          {
            while(1);
          }
        }
      }
      else
      {
        while(__HAL_RCC_GET_SYSCLK_SOURCE() != RCC_CFGR_SWS_HSI)
        {
          if((int32_t) (HAL_GetTick() - tickstart ) > CLOCKSWITCH_TIMEOUT_VALUE)
          {
            while(1);
          }
        }
      }
    }
  
  /* Decreasing the number of wait states because of lower CPU frequency */
  if(FLatency < (FLASH->ACR & FLASH_ACR_LATENCY))
  {
    /* Program the new number of wait states to the LATENCY bits in the FLASH_ACR register */
    __HAL_FLASH_SET_LATENCY(FLatency);

    /* Check that the new number of wait states is taken into account to access the Flash
    memory by reading the FLASH_ACR register */
    if((FLASH->ACR & FLASH_ACR_LATENCY) != FLatency)
    {
      while(1);
    }
 }

